package game;

// Подключение необходимых библиотек
import javax.swing.*; 
import java.awt.*; 
import java.awt.event.*; 
 
// Класс для подарка, падающего сверху
class podar{

	public Image img; // Изображение подарка
	// Положение подарка на игровом поле, в пикселях, х - отступ слева,
	// у - отступ сверху
	// Переменная логического типа,
	// показывающая активность подарка, есть он в игровом поле или нет
	public int x, y;
	public Boolean act;
	Timer timerUpdate; // Таймер, отвечающий за движение подарка вниз
	
	// Конструктор класса
	public podar(Image img){
		// Создание и настройка таймера, отвечающего за движение подарка
		// вниз
		timerUpdate = new Timer(50, new ActionListener(){
			public void actionPerformed(ActionEvent e){
				vniz();// Метод, осуществляющий движение подарка вниз
				pole.secLived++;
			}
		});
		// Передача изображения из круглых скобок
		// Конструктора класса в переменную класса
		// Изначально делаем подарок неактивным,
		// Отсутствующим на игровом поле
		this.img = img;
		act = false;
	}
	
	// Метод, выполняющий активизацию подарка на игровом поле,
	// вывод сверху игрового поля
	public void start(){
		timerUpdate.start(); // Запуск таймера
		y = 0; // Отступ сверху в пикселях
		// Отступ слева в пикселях,
		// получаем случайным образом от 0 до 700
		x = 50+(int)(Math.random()*1800);
		act = true; // Свойство активность устанавливаем в true
	}
	
	// Метод, осуществляющий движение подарка вниз
	public void vniz (){
		if(act){ // Если подарок активен на игровом поле
			y += 2; // Увеличение отступа сверху на 6 пикселей
			if(Math.random() > 0.5){
				x += 2;
			} else {
				x -= 2;
			}
		}
		if((y + img.getHeight(null)) >= 1440){ // Если подарок достиг нижней границы
			timerUpdate.stop(); // Остановка таймера
		}
	}
	
	// Метод, выполняющий отрисовку подарка на игровом поле, если он активен
	public void draw(Graphics gr){
		if(act){
			gr.drawImage(img, x, y, null); // Рисование изображения
		}
	}
}
